J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1"
xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>TC37x</name>
  <version>1.2</version>
  <description>TC37x</description>
  <!--Bus Interface Properties-->
  <!--AURIX is byte addressable-->
  <addressUnitBits>8</addressUnitBits>
  <!--the maximum data bit width accessible within a single transfer-->
  <width>32</width>
  <!--Register Default Properties-->
  <size>0x20</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
		<peripherals>
		<peripheral>
			<name>STM0</name>
            <description>System Timer 0</description>
			<baseAddress>0xF0001000</baseAddress>
            <addressBlock>
			  <offset>0</offset>
			  <size>0x100</size>
			  <usage>registers</usage>
            </addressBlock>
		<registers>
		  <register>
			<name>STM0_CLC</name>
			<description>Clock Control Register</description>
			<size>32</size>
			<addressOffset>0</addressOffset>
            <access>read-write</access>
			<resetValue>00000000</resetValue>
			<fields>
			  <field>
				<name>DISR</name>
				<description>Module Disable Request Bit</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
                <access>read-write</access>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No disable requested</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Disable requested</CodingDescription>
				</Coding>
			  </field>
			<field>
				<name>DISS</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Module Disable Status Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>STM module is enabled</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>STM module is disabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>EDIS</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<description>Sleep Mode Enable Control</description>
			</field>
		  </fields>
		</register>
		<register>
			<name>STM0_ID</name>
			<description>Module Identification Register</description>
			<size>32</size>
			<addressOffset>8</addressOffset>
			<resetValue>0x0000C000</resetValue>
		  <fields>
			<field>
				<name>MODREV</name>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
				<access>read-only</access>
				<description>Module Revision Number</description>
			</field>
			<field>
				<name>MODaccess</name>
				<bitOffset>8</bitOffset>
				<bitWidth>8</bitWidth>
				<access>read-only</access>
				<description>Module access</description>
			</field>
			<field>
				<name>MODNUM</name>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-only</access>
				<description>Module Number Value</description>
			</field>
        </fields>
		</register>
		<register>
			<name>STM0_TIM0</name>
			<description>Timer Register 0</description>
			<size>32</size>
			<addressOffset>0x10</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>STM[31:0]</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-only</access>
				<description>System Timer field [31:0]</description>
			</field>
		</register>
		<register>
			<name>STM0_TIM0SV</name>
			<description>Timer Register 0 Second View</description>
			<size>32</size>
			<addressOffset>0x50</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>STM[31:0]</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-only</access>
				<description>System Timer field [31:0]</description>
			</field>
		</register>
		<register>
			<name>STM0_TIM1</name>
			<description>Timer Register 1</description>
			<size>32</size>
			<addressOffset>0x14</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>STM[35:4]</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-only</access>
				<description>System Timer field [35:4]</description>
			</field>
		</register>
		<register>
			<name>STM0_CAP</name>
			<description>Timer Capture Register</description>
			<size>32</size>
			<addressOffset>0x2C</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>STMCAP[63:32]</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-only</access>
				<description>Captured System Timer field [63:32]</description>
			</field>
		</register>
		<register>
			<name>STM0_CAPSV</name>
			<description>Timer Capture Register Second View</description>
			<size>32</size>
			<addressOffset>0x54</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>STMCAP[63:32]</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-only</access>
				<description>Captured System Timer field [63:32]</description>
			</field>
		</register>
		<register>
			<name>STM0_CMP0</name>
			<description>Compare Register 0</description>
			<size>32</size>
			<addressOffset>0x30</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>CMPVAL</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-write</access>
				<description>Compare Value of Compare Register x</description>
			</field>
		</register>
		<register>
			<name>STM0_CMP1</name>
			<description>Compare Register 1</description>
			<size>32</size>
			<addressOffset>0x34</addressOffset>
			<resetValue>00000000</resetValue>
			<field>
				<name>CMPVAL</name>
				<bitOffset>0</bitOffset>
				<bitWidth>32</bitWidth>
				<access>read-write</access>
				<description>Compare Value of Compare Register x</description>
			</field>
		</register>
		<register>
			<name>STM0_CMCON</name>
			<description>Compare Match Control Register</description>
			<size>32</size>
			<addressOffset>0x38</addressOffset>
			<resetValue>00000000</resetValue>
            <fields>
			<field>
				<name>MSIZE0</name>
				<bitOffset>0</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
				<description>Compare Register Size for CMP0</description>
				<Coding>
					<CodingValue>
						<Bin>00000</Bin>
					</CodingValue>
					<CodingDescription>CMP0[0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>00001</Bin>
					</CodingValue>
					<CodingDescription>CMP0[1:0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11110</Bin>
					</CodingValue>
					<CodingDescription>CMP0[30:0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11111</Bin>
					</CodingValue>
					<CodingDescription>CMP0[31:0] used for compare operation</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>MSTART0</name>
				<bitOffset>8</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
				<description>Start Bit Location for CMP0</description>
				<Coding>
					<CodingValue>
						<Bin>00000</Bin>
					</CodingValue>
					<CodingDescription>STM[0] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>00001</Bin>
					</CodingValue>
					<CodingDescription>STM[1] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11110</Bin>
					</CodingValue>
					<CodingDescription>STM[30] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11111</Bin>
					</CodingValue>
					<CodingDescription>STM[31] is the lowest bit number</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>MSIZE1</name>
				<bitOffset>16</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
				<description>Compare Register Size for CMP1</description>
				<Coding>
					<CodingValue>
						<Bin>00000</Bin>
					</CodingValue>
					<CodingDescription>CMP1[0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>00001</Bin>
					</CodingValue>
					<CodingDescription>CMP1[1:0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11110</Bin>
					</CodingValue>
					<CodingDescription>CMP1[30:0] used for compare operation</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11111</Bin>
					</CodingValue>
					<CodingDescription>CMP1[31:0] used for compare operation</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>MSTART1</name>
				<bitOffset>24</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
				<description>Start Bit Location for CMP1</description>
				<Coding>
					<CodingValue>
						<Bin>00000</Bin>
					</CodingValue>
					<CodingDescription>STM[0] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>00001</Bin>
					</CodingValue>
					<CodingDescription>STM[1] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11110</Bin>
					</CodingValue>
					<CodingDescription>STM[30] is the lowest bit number</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>11111</Bin>
					</CodingValue>
					<CodingDescription>STM[31] is the lowest bit number</CodingDescription>
				</Coding>
			</field>
	   	  </fields>
		</register>
		<register>
			<name>STM0_ICR</name>
			<description>Interrupt Control Register</description>
			<size>32</size>
			<addressOffset>0x3C</addressOffset>
			<resetValue>00000000</resetValue>
	   	  <fields>
			<field>
				<name>CMP0EN</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Compare Register CMP0 Interrupt Enable Control</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Interrupt on compare match with CMP0 disabled</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt on compare match with CMP0 enabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP0IR</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Compare Register CMP0 Interrupt Request Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>A compare match interrupt has not been detected since the bit has been cleared for the last time.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A compare match interrupt has been detected.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP0OS</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Compare Register CMP0 Interrupt Output Selection</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Interrupt output STMIR0 selected</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt output STMIR1 selected</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP1EN</name>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Compare Register CMP1 Interrupt Enable Control</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Interrupt on compare match with CMP1 disabled</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt on compare match with CMP1 enabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP1IR</name>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Compare Register CMP1 Interrupt Request Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>A compare match interrupt has not been detected since the bit has been cleared for the last time.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A compare match interrupt has been detected.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP1OS</name>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Compare Register CMP1 Interrupt Output Selection</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Interrupt output STMIR0 selected</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt output STMIR1 selected</CodingDescription>
				</Coding>
			</field>
        </fields>
		</register>
		<register>
			<name>STM0_ISCR</name>
			<description>Interrupt Set/Clear Register</description>
			<size>32</size>
			<addressOffset>0x40</addressOffset>
			<resetValue>00000000</resetValue>
			<fields>
			<field>
				<name>CMP0IRR</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Reset Compare Register CMP0 Interrupt Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP0IR is not changed.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP0IR is cleared.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP0IRS</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Set Compare Register CMP0 Interrupt Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP0IR is not changed.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP0IR is set. The state of bit CMP0IRR is “don’t care” in this case.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP1IRR</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Reset Compare Register CMP1 Interrupt Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP1IR is not changed.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP1IR is cleared.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CMP1IRS</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Set Compare Register CMP1 Interrupt Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP1IR is not changed.</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Bit ICR.CMP1IR is set. The state of bit CMP1IRR is “don’t care” in this case.</CodingDescription>
				</Coding>
			</field>
        </fields>
		</register>
		<register>
			<name>STM0_OCS</name>
			<description>OCDS Control and Status Register</description>
			<size>32</size>
			<addressOffset>0xE8</addressOffset>
			<resetValue>00000000</resetValue>
			<fields>
			<field>
				<name>SUS</name>
				<bitOffset>24</bitOffset>
				<bitWidth>4</bitWidth>
				<access>read-write</access>
				<description>OCDS Suspend Control</description>
				<Coding>
					<CodingValue>
						<Hex>0</Hex>
					</CodingValue>
					<CodingDescription>Will not suspend</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>1</Hex>
					</CodingValue>
					<CodingDescription>Reserved, do not use this combination</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>2</Hex>
					</CodingValue>
					<CodingDescription>64-bit counter will be stopped</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>SUS_P</name>
				<bitOffset>28</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>SUS Write Protection</description>
			</field>
			<field>
				<name>SUSSTA</name>
				<bitOffset>29</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Suspend State</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Module is not (yet) suspended</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Module is suspended</CodingDescription>
				</Coding>
			</field>
        </fields>
	</register>
