J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
	</registers>
	</peripheral>
	<peripheral>
			<name>SRCS</name>
            <description>Service Request Control Registers</description>
			<baseAddress>0xF0038000</baseAddress>
            <addressBlock>
			  <offset>0</offset>
			  <size>0x1000</size>
			  <usage>registers</usage>
            </addressBlock>
		<registers>
	      <register>
			<name>SRC_STM0SR0</name>
			<description>System Timer 0 Service Request 0</description>
			<size>32</size>
			<addressOffset>0x300</addressOffset>
			<resetValue>00000000</resetValue>
			<fields>
			<field>
				<name>SRPN</name>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
				<access>read-write</access>
				<description>Service Request Priority Number</description>
			</field>
			<field>
				<name>SRE</name>
				<bitOffset>10</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Service Request Enable</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Service request is disabled</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Service request is enabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TOS</name>
				<bitOffset>11</bitOffset>
				<bitWidth>3</bitWidth>
				<access>read-write</access>
				<description>access of Service Control</description>
				<Coding>
					<CodingValue>
						<Hex>0</Hex>
					</CodingValue>
					<CodingDescription>CPU0 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>1</Hex>
					</CodingValue>
					<CodingDescription>DMA service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>2</Hex>
					</CodingValue>
					<CodingDescription>CPU1 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>3</Hex>
					</CodingValue>
					<CodingDescription>CPU2 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>4</Hex>
					</CodingValue>
					<CodingDescription>CPU3 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>5</Hex>
					</CodingValue>
					<CodingDescription>CPU4 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>6</Hex>
					</CodingValue>
					<CodingDescription>CPU5 service is initiated</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Hex>7</Hex>
					</CodingValue>
					<CodingDescription>PDMA service is initiated (TC39xB)</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>ECC</name>
				<bitOffset>16</bitOffset>
				<bitWidth>5</bitWidth>
				<access>read-write</access>
				<description>ECC</description>
			</field>
			<field>
				<name>SRR</name>
				<bitOffset>24</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Service Request Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No service request is pending</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A service request is pending</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>CLRR</name>
				<bitOffset>25</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Request Clear Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No action</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Clear SRR; bit value is not stored; read always returns 0; no action if SETR is set in parallel.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>SETR</name>
				<bitOffset>26</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Request Set Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No action</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Set SRR and SWS; SRR bit value is not stored; read always returns 0; no action if CLRR is set in parallel.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>IOV</name>
				<bitOffset>27</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Interrupt Trigger Overflow Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No Interrupt Trigger Overflow detected</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt Overflow Detected.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>IOVCLR</name>
				<bitOffset>28</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>Interrupt Trigger Overflow Clear Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No action</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Clear IOV; bit value is not stored; read always returns 0.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>SWS</name>
				<bitOffset>29</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>SW Sticky Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No interrupt was initiated via SETR</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Interrupt was initiated via SETR</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>SWSCLR</name>
				<bitOffset>30</bitOffset>
				<bitWidth>1</bitWidth>
				<access>write-only</access>
				<description>SW Sticky Clear Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No action</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Clear SWS; bit value is not stored; read always returns 0.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>Reserved</name>
				<bitOffset>31</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Reserved</description>
			</field>
		</fields>
		</register>
