J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
		</registers>
        <interrupt>
            <name>__interrupt_handler_1</name>
			<description>Interrupt 1 entry</description>
            <value>1</value>
        </interrupt>
        <interrupt>
            <name>__interrupt_handler_2</name>
			<description>Interrupt 2 entry</description>
            <value>2</value>
        </interrupt>
        <interrupt>
            <name>__interrupt_handler_3</name>
			<description>Interrupt 3 entry</description>
            <value>3</value>
        </interrupt>
        <interrupt>
            <name>__interrupt_handler_4</name>
			<description>Interrupt 4 entry</description>
            <value>4</value>
        </interrupt>
        <interrupt>
            <name>__interrupt_handler_5</name>
			<description>Interrupt 5 entry</description>
            <value>5</value>
        </interrupt>
        <interrupt>
            <name>__interrupt_handler_6</name>
			<description>Interrupt 6 entry</description>
            <value>6</value>
        </interrupt>
	  </peripheral>
      <peripheral>
         <name>P00</name>
         <baseAddress>0xF003A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
      <registers>
      <register>
         <name>OUT</name>
         <description>Port 00 Output Register</description>
         <size>32</size>
         <addressOffset>0</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>P0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Bit 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The output level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
