J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      <register>
         <name>IOCR4</name>
         <description>Port 00 Input/Output Control Register 4</description>
         <size>32</size>
         <addressOffset>0x14</addressOffset>
         <fields>
         <field>
            <name>PC4</name>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 4</description>
         </field>
         <field>
            <name>PC5</name>
            <bitOffset>11</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 5</description>
         </field>
         <field>
            <name>PC6</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 6</description>
         </field>
         <field>
            <name>PC7</name>
            <bitOffset>27</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 7</description>
         </field>
         </fields>
      </register>
      <register>
         <name>IOCR8</name>
         <description>Port 00 Input/Output Control Register 8</description>
         <size>32</size>
         <addressOffset>0x18</addressOffset>
         <fields>
         <field>
            <name>PC8</name>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 8</description>
         </field>
         <field>
            <name>PC9</name>
            <bitOffset>11</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 9</description>
         </field>
         <field>
            <name>PC10</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 10</description>
         </field>
         <field>
            <name>PC11</name>
            <bitOffset>27</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 11</description>
         </field>
         </fields>
      </register>
      <register>
         <name>IOCR12</name>
         <description>Port 00 Input/Output Control Register 12</description>
         <size>32</size>
         <addressOffset>0x1C</addressOffset>
         <fields>
         <field>
            <name>PC12</name>
            <bitOffset>3</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 12</description>
         </field>
         <field>
            <name>PC13</name>
            <bitOffset>11</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 13</description>
         </field>
         <field>
            <name>PC14</name>
            <bitOffset>19</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 14</description>
         </field>
         <field>
            <name>PC15</name>
            <bitOffset>27</bitOffset>
            <bitWidth>5</bitWidth>
            <access>read-write</access>
            <description>Port Control for Port 00 Pin 15</description>
         </field>
         </fields>
      </register>
      <register>
         <name>IN</name>
         <description>Port 00 Input Register</description>
         <size>32</size>
         <addressOffset>0x24</addressOffset>
         <resetValue>0</resetValue>
         <fields>
         <field>
            <name>P0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>P15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Input Bit 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 0.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The input level of Pn.x is 1.</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>PDR0</name>
         <description>Port 00 Pad Driver Mode Register 0</description>
         <size>32</size>
         <addressOffset>0x40</addressOffset>
         <resetValue>0x33333333</resetValue>
         <fields>
         <field>
            <name>PD0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 0</description>
         </field>
         <field>
            <name>PD1</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 1</description>
         </field>
         <field>
            <name>PD2</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 2</description>
         </field>
         <field>
            <name>PD3</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 3</description>
         </field>
         <field>
            <name>PD4</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 4</description>
         </field>
         <field>
            <name>PD5</name>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 5</description>
         </field>
         <field>
            <name>PD6</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 6</description>
         </field>
         <field>
            <name>PD7</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 7</description>
         </field>
         <field>
            <name>PL0</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 0</description>
         </field>
         <field>
            <name>PL1</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 1</description>
         </field>
         <field>
            <name>PL2</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 2</description>
         </field>
         <field>
            <name>PL3</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 3</description>
         </field>
         <field>
            <name>PL4</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 4</description>
         </field>
         <field>
            <name>PL5</name>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 5</description>
         </field>
         <field>
            <name>PL6</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 6</description>
         </field>
         <field>
            <name>PL7</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 7</description>
         </field>
         </fields>
      </register>
      <register>
         <name>PDR1</name>
         <description>Port 00 Pad Driver Mode Register 1</description>
         <size>32</size>
         <addressOffset>0x44</addressOffset>
         <resetValue>0x33333333</resetValue>
         <fields>
         <field>
            <name>PD8</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 8</description>
         </field>
         <field>
            <name>PD9</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 9</description>
         </field>
         <field>
            <name>PD10</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 10</description>
         </field>
         <field>
            <name>PD11</name>
            <bitOffset>12</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 11</description>
         </field>
         <field>
            <name>PD12</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 12</description>
         </field>
         <field>
            <name>PD13</name>
            <bitOffset>20</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 13</description>
         </field>
         <field>
            <name>PD14</name>
            <bitOffset>24</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 14</description>
         </field>
         <field>
            <name>PD15</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Driver Mode for Pin 15</description>
         </field>
         <field>
            <name>PL8</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 8</description>
         </field>
         <field>
            <name>PL9</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 9</description>
         </field>
         <field>
            <name>PL10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 10</description>
         </field>
         <field>
            <name>PL11</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 11</description>
         </field>
         <field>
            <name>PL12</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 12</description>
         </field>
         <field>
            <name>PL13</name>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 13</description>
         </field>
         <field>
            <name>PL14</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 14</description>
         </field>
         <field>
            <name>PL15</name>
            <bitOffset>30</bitOffset>
            <bitWidth>2</bitWidth>
            <access>read-write</access>
            <description>Pad Level Selection for Pin 15</description>
         </field>
         </fields>
      </register>
