J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      <register>
         <name>ESR</name>
         <description>Port 00 Emergency Stop Register</description>
         <size>32</size>
         <addressOffset>0x50</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>EN0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Emergency Stop Enable for Pin 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is disabled.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Emergency stop function for Pn.x is enabled.</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
