J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      <register>
         <name>PDISC</name>
         <description>Port 13 Pin Function Decision Control Register</description>
         <size>32</size>
         <addressOffset>0x60</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PDIS0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PDIS15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Pin Function Decision Control for Pin 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is enabled and can be selected for digital function.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Pad Pn.x is disabled and can be selected for analog input function (where this is available).</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>PCSR</name>
         <description>Port 13 Pin Controller Select Register</description>
         <size>32</size>
         <addressOffset>0x64</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>SEL10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Select for Pin 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Disable EVADC PDD/MD feature of pin x.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Enable EVADC PDD/MD feature of pin x.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>SEL11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Output Select for Pin 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Disable EVADC PDD/MD feature of pin x.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Enable EVADC PDD/MD feature of pin x.</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>LCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-only</access>
            <description>Lock Status</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>The register is unlocked and can be updated.</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>The register is locked (a write transfer to SCR is ongoing) and can not be updated.</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMSR0</name>
         <description>Port 13 Output Modification Set Register 0</description>
         <size>32</size>
         <addressOffset>0x70</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PS0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMSR4</name>
         <description>Port 13 Output Modification Set Register 4</description>
         <size>32</size>
         <addressOffset>0x74</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PS4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMSR8</name>
         <description>Port 13 Output Modification Set Register 8</description>
         <size>32</size>
         <addressOffset>0x78</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PS8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
