J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      <register>
         <name>ACCEN0</name>
         <description>Port 13 Access Enable Register 0</description>
         <size>32</size>
         <addressOffset>0xFC</addressOffset>
         <resetValue>0xFFFFFFFF</resetValue>
         <fields>
         <field>
            <name>EN0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN2</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN3</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN5</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN6</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN7</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN8</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN9</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN10</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN11</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN16</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 16</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN17</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 17</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN18</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 18</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN19</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 19</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN20</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 20</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN21</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 21</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN22</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 22</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN23</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 23</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN24</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 24</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN25</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 25</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN26</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 26</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN27</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 27</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN28</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 28</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN29</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 29</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN30</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 30</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>EN31</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Access Enable for Master TAG ID 31</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>Write access will not be executed</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Write access will be executed</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
