J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      <register>
         <name>OMSR12</name>
         <description>Port 33 Output Modification Set Register 12</description>
         <size>32</size>
         <addressOffset>0x7C</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PS12</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS13</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS14</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PS15</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Set Bit 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Sets Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMCR0</name>
         <description>Port 33 Output Modification Clear Register 0</description>
         <size>32</size>
         <addressOffset>0x80</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PCL0</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 0</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL1</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 1</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL2</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 2</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL3</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 3</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMCR4</name>
         <description>Port 33 Output Modification Clear Register 4</description>
         <size>32</size>
         <addressOffset>0x84</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PCL4</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 4</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL5</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 5</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL6</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 6</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL7</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 7</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMCR8</name>
         <description>Port 33 Output Modification Clear Register 8</description>
         <size>32</size>
         <addressOffset>0x88</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PCL8</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 8</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL9</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 9</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL10</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 10</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL11</name>
            <bitOffset>27</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 11</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
      <register>
         <name>OMCR12</name>
         <description>Port 33 Output Modification Clear Register 12</description>
         <size>32</size>
         <addressOffset>0x8C</addressOffset>
         <resetValue>00000000</resetValue>
         <fields>
         <field>
            <name>PCL12</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 12</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL13</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 13</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL14</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 14</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         <field>
            <name>PCL15</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
            <description>Clear Bit 15</description>
            <Coding>
               <CodingValue>
                  <Bin>0</Bin>
               </CodingValue>
               <CodingDescription>No operation</CodingDescription>
            </Coding>
            <Coding>
               <CodingValue>
                  <Bin>1</Bin>
               </CodingValue>
               <CodingDescription>Clears Pn_OUT.Px</CodingDescription>
            </Coding>
         </field>
         </fields>
      </register>
