J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
      </registers>
      </peripheral>
      <peripheral>
          <name>SCU</name>
            <description>System Control Unit</description>
            <baseAddress>0xf0036000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
		<register>
			<name>SCU_WDTSCON0</name>
			<description>System WDT Control Register 0</description>
			<size>32</size>
			<addressOffset>0x2A8</addressOffset>
			<resetValue>0xFFFC000E</resetValue>
            <fields>
			<field>
				<name>ENDINIT</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>End-of-Initialization Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Access to Endinit-protected registers is permitted (default after ApplicationReset)</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Access to Endinit-protected registers is not permitted.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>LCK</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Lock Bit to Control Access to WDTxCON0</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Register WDTxCON0 is unlocked</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Register WDTxCON0 is locked (default after ApplicationReset)</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PW</name>
				<bitOffset>2</bitOffset>
				<bitWidth>14</bitWidth>
				<access>read-write</access>
				<description>User-Definable Password Field for Access to WDTxCON0</description>
			</field>
			<field>
				<name>REL</name>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-write</access>
				<description>Reload Value for the WDT (also Time Check Value)</description>
			</field>
            </fields>
		</register>
		<register>
			<name>SCU_WDTCPU0CON0</name>
			<description>CPU0 WDT Control Register 0</description>
			<size>32</size>
			<addressOffset>0x24C</addressOffset>
			<resetValue>0xFFFC000E</resetValue>
            <fields>
			<field>
				<name>ENDINIT</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>End-of-Initialization Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Access to Endinit-protected registers is permitted (default after ApplicationReset)</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Access to Endinit-protected registers is not permitted.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>LCK</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Lock Bit to Control Access to WDTxCON0</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Register WDTxCON0 is unlocked</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Register WDTxCON0 is locked (default after ApplicationReset)</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PW</name>
				<bitOffset>2</bitOffset>
				<bitWidth>14</bitWidth>
				<access>read-write</access>
				<description>User-Definable Password Field for Access to WDTxCON0</description>
			</field>
			<field>
				<name>REL</name>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-write</access>
				<description>Reload Value for the WDT (also Time Check Value)</description>
			</field>
            </fields>
		</register>
		<register>
			<name>SCU_WDTSCON1</name>
			<description>System WDT Control Register 1</description>
			<size>32</size>
			<addressOffset>0x2AC</addressOffset>
			<resetValue>0</resetValue>
            <fields>
			<field>
				<name>CLRIRF</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Clear Internal Reset Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No action</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to clear the internal previous-SMU-reset flag</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>IR1</name>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Input Frequency Request Control</description>
			</field>
			<field>
				<name>IR0</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Input Frequency Request Control</description>
			</field>
			<field>
				<name>DR</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Disable Request Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to enable the WDT</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to disable the WDT</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>UR</name>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Unlock Restriction Request Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to disable SMU restriction of WDT unlock</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to enable SMU restriction of WDT unlock</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PAR</name>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Password Auto-sequence Request Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request no automatic change of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request automatic sequence of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCR</name>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Counter Check Request Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to check only that REL field is written with existing REL value during Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to check that REL field is written with correct TIM Count (within tolerance of WDTxSR.TCT) during Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCTR</name>
				<bitOffset>9</bitOffset>
				<bitWidth>7</bitWidth>
				<access>read-write</access>
				<description>Timer Check Tolerance Request</description>
			</field>
            </fields>
		</register>
		<register>
			<name>SCU_WDTCPU0CON1</name>
			<description>CPU0 WDT Control Register 1</description>
			<size>32</size>
			<addressOffset>0x250</addressOffset>
			<resetValue>0</resetValue>
            <fields>
			<field>
				<name>IR1</name>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Input Frequency Request Control</description>
			</field>
			<field>
				<name>IR0</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Input Frequency Request Control</description>
			</field>
			<field>
				<name>DR</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Disable Request Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to enable the WDT</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to disable the WDT</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>UR</name>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Unlock Restriction Request Control Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to disable SMU restriction of WDT unlock</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to enable SMU restriction of WDT unlock</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PAR</name>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Password Auto-sequence Request Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request no automatic change of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request automatic sequence of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCR</name>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-write</access>
				<description>Counter Check Request Bit</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Request to check only that REL field is written with existing REL value during Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Request to check that REL field is written with correct TIM Count (within tolerance of WDTxSR.TCT) during Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCTR</name>
				<bitOffset>9</bitOffset>
				<bitWidth>7</bitWidth>
				<access>read-write</access>
				<description>Timer Check Tolerance Request</description>
			</field>
            </fields>
		</register>
		<register>
			<name>SCU_WDTSSR</name>
			<description>System WDT Status Register</description>
			<size>32</size>
			<addressOffset>0x2B0</addressOffset>
			<resetValue>0xFFFC0010</resetValue>
            <fields>
			<field>
				<name>AE</name>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Access Error Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No Watchdog access error</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A Watchdog access error has occurred</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>OE</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Overflow Error Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No Watchdog overflow error</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A Watchdog overflow error has occurred</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>IS1</name>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Input Clock Status</description>
			</field>
			<field>
				<name>IS0</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Input Clock Status</description>
			</field>
			<field>
				<name>DS</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Enable/Disable Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>WDT is enabled (default after ApplicationReset)</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>WDT is disabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TO</name>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Time-Out Mode Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>The Watchdog is not operating in Time-Out Mode</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>The Watchdog is operating in Time-Out Mode (default after ApplicationReset)</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>US</name>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>SMU Unlock Restriction Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>WDT unlock permitted at any time</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>WDT unlock only permitted when the SMU is in the RUN state.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PAS</name>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Password Auto-sequence Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No change of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Automatically sequence the password after each Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCS</name>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Timer Check Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Check only that REL field is written with existing REL value during Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Check that REL field is written with inverted estimated TIM value (within +/- TCT value) during Password Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCT</name>
				<bitOffset>9</bitOffset>
				<bitWidth>7</bitWidth>
				<access>read-only</access>
				<description>Timer Check Tolerance</description>
			</field>
			<field>
				<name>TIM</name>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-only</access>
				<description>Timer Value</description>
			</field>
            </fields>
		</register>
		<register>
			<name>SCU_WDTCPU0SR</name>
			<description>CPU0 WDT Status Register</description>
			<size>32</size>
			<addressOffset>0x254</addressOffset>
			<resetValue>0xFFFC0010</resetValue>
            <fields>
			<field>
				<name>AE</name>
				<bitOffset>0</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-only</access>
				<description>Watchdog Access Error Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No Watchdog access error</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A Watchdog access error has occurred</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>OE</name>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Overflow Error Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No Watchdog overflow error</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>A Watchdog overflow error has occurred</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>IS1</name>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Input Clock Status</description>
			</field>
			<field>
				<name>IS0</name>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Input Clock Status</description>
			</field>
			<field>
				<name>DS</name>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Enable/Disable Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>WDT is enabled (default after ApplicationReset)</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>WDT is disabled</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TO</name>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Watchdog Time-Out Mode Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>The Watchdog is not operating in Time-Out Mode</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>The Watchdog is operating in Time-Out Mode (default after ApplicationReset)</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>US</name>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>SMU Unlock Restriction Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>WDT unlock permitted at any time</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>WDT unlock only permitted when the SMU is in the RUN state.</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>PAS</name>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Password Auto-sequence Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>No change of password after each Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Automatically sequence the password after each Modify Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCS</name>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
				<access>read-only</access>
				<description>Timer Check Status Flag</description>
				<Coding>
					<CodingValue>
						<Bin>0</Bin>
					</CodingValue>
					<CodingDescription>Check only that REL field is written with existing REL value during Modify Access or Check Access</CodingDescription>
				</Coding>
				<Coding>
					<CodingValue>
						<Bin>1</Bin>
					</CodingValue>
					<CodingDescription>Check that REL field is written with inverted estimated TIM value (within +/- TCT value) during Password Access or Check Access</CodingDescription>
				</Coding>
			</field>
			<field>
				<name>TCT</name>
				<bitOffset>9</bitOffset>
				<bitWidth>7</bitWidth>
				<access>read-only</access>
				<description>Timer Check Tolerance</description>
			</field>
			<field>
				<name>TIM</name>
				<bitOffset>16</bitOffset>
				<bitWidth>16</bitWidth>
				<access>read-only</access>
				<description>Timer Value</description>
			</field>
            </fields>
		</register>
