J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL8</name>
                            <description>PCL8</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL9</name>
                            <description>PCL9</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL10</name>
                            <description>PCL10</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL11</name>
                            <description>PCL11</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL12</name>
                            <description>PCL12</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL13</name>
                            <description>PCL13</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL14</name>
                            <description>PCL14</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL15</name>
                            <description>PCL15</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ID</name>
                    <description>ID</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xc8c000</resetValue>
                    <resetMask>0xffffff00</resetMask>
                    <fields>
                        <field>
                            <name>MODREV</name>
                            <description>MODREV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MODTYPE</name>
                            <description>MODTYPE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MODNUMBER</name>
                            <description>MODNUMBER</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOCR0</name>
                    <description>IOCR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC0</name>
                            <description>PC0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R1</name>
                            <description>R1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC1</name>
                            <description>PC1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R2</name>
                            <description>R2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC2</name>
                            <description>PC2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R3</name>
                            <description>R3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC3</name>
                            <description>PC3</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOCR4</name>
                    <description>IOCR4</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R4</name>
                            <description>R4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC4</name>
                            <description>PC4</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R5</name>
                            <description>R5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC5</name>
                            <description>PC5</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R6</name>
                            <description>R6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC6</name>
                            <description>PC6</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R7</name>
                            <description>R7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC7</name>
                            <description>PC7</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOCR8</name>
                    <description>IOCR8</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R8</name>
                            <description>R8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC8</name>
                            <description>PC8</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R9</name>
                            <description>R9</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC9</name>
                            <description>PC9</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R10</name>
                            <description>R10</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC10</name>
                            <description>PC10</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R11</name>
                            <description>R11</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC11</name>
                            <description>PC11</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOCR12</name>
                    <description>IOCR12</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R12</name>
                            <description>R12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC12</name>
                            <description>PC12</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R13</name>
                            <description>R13</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC13</name>
                            <description>PC13</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R14</name>
                            <description>R14</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC14</name>
                            <description>PC14</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R15</name>
                            <description>R15</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PC15</name>
                            <description>PC15</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
