J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>IN</name>
                    <description>IN</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffff0000</resetMask>
                    <fields>
                        <field>
                            <name>P0</name>
                            <description>P0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P1</name>
                            <description>P1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P2</name>
                            <description>P2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P3</name>
                            <description>P3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P4</name>
                            <description>P4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P5</name>
                            <description>P5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P6</name>
                            <description>P6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P7</name>
                            <description>P7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P8</name>
                            <description>P8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P9</name>
                            <description>P9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P10</name>
                            <description>P10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P11</name>
                            <description>P11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P12</name>
                            <description>P12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P13</name>
                            <description>P13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P14</name>
                            <description>P14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P15</name>
                            <description>P15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R16</name>
                            <description>R16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDR0</name>
                    <description>PDR0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x22222222</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PD0</name>
                            <description>PD0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL0</name>
                            <description>PL0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD1</name>
                            <description>PD1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL1</name>
                            <description>PL1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD2</name>
                            <description>PD2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL2</name>
                            <description>PL2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD3</name>
                            <description>PD3</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL3</name>
                            <description>PL3</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD4</name>
                            <description>PD4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL4</name>
                            <description>PL4</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD5</name>
                            <description>PD5</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL5</name>
                            <description>PL5</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD6</name>
                            <description>PD6</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL6</name>
                            <description>PL6</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD7</name>
                            <description>PD7</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL7</name>
                            <description>PL7</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
