J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>PDR1</name>
                    <description>PDR1</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x22222222</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PD8</name>
                            <description>PD8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL8</name>
                            <description>PL8</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD9</name>
                            <description>PD9</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL9</name>
                            <description>PL9</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD10</name>
                            <description>PD10</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL10</name>
                            <description>PL10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD11</name>
                            <description>PD11</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL11</name>
                            <description>PL11</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD12</name>
                            <description>PD12</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL12</name>
                            <description>PL12</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD13</name>
                            <description>PD13</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL13</name>
                            <description>PL13</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD14</name>
                            <description>PD14</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL14</name>
                            <description>PL14</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD15</name>
                            <description>PD15</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PL15</name>
                            <description>PL15</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ESR</name>
                    <description>ESR</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>EN0</name>
                            <description>EN0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN1</name>
                            <description>EN1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN2</name>
                            <description>EN2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN3</name>
                            <description>EN3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN4</name>
                            <description>EN4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN5</name>
                            <description>EN5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN6</name>
                            <description>EN6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN7</name>
                            <description>EN7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R8</name>
                            <description>R8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EN9</name>
                            <description>EN9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN10</name>
                            <description>EN10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN11</name>
                            <description>EN11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN12</name>
                            <description>EN12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN13</name>
                            <description>EN13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN14</name>
                            <description>EN14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EN15</name>
                            <description>EN15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R16</name>
                            <description>R16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
