J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>PCSR</name>
                    <description>PCSR</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x100</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEL0</name>
                            <description>SEL0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL1</name>
                            <description>SEL1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL2</name>
                            <description>SEL2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL3</name>
                            <description>SEL3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL4</name>
                            <description>SEL4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL5</name>
                            <description>SEL5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL6</name>
                            <description>SEL6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL7</name>
                            <description>SEL7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL8</name>
                            <description>SEL8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL9</name>
                            <description>SEL9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL10</name>
                            <description>SEL10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL11</name>
                            <description>SEL11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL12</name>
                            <description>SEL12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL13</name>
                            <description>SEL13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL14</name>
                            <description>SEL14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL15</name>
                            <description>SEL15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R16</name>
                            <description>R16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>15</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LCK</name>
                            <description>LCK</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OMSR0</name>
                    <description>OMSR0</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PS0</name>
                            <description>PS0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS1</name>
                            <description>PS1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS2</name>
                            <description>PS2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS3</name>
                            <description>PS3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R4</name>
                            <description>R4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>28</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
