J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>OMSR4</name>
                    <description>OMSR4</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PS4</name>
                            <description>PS4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS5</name>
                            <description>PS5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS6</name>
                            <description>PS6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS7</name>
                            <description>PS7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R8</name>
                            <description>R8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OMSR8</name>
                    <description>OMSR8</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PS8</name>
                            <description>PS8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS9</name>
                            <description>PS9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS10</name>
                            <description>PS10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS11</name>
                            <description>PS11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R12</name>
                            <description>R12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>20</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OMSR12</name>
                    <description>OMSR12</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PS12</name>
                            <description>PS12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS13</name>
                            <description>PS13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS14</name>
                            <description>PS14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS15</name>
                            <description>PS15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R16</name>
                            <description>R16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OMCR0</name>
                    <description>OMCR0</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCL0</name>
                            <description>PCL0</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL1</name>
                            <description>PCL1</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL2</name>
                            <description>PCL2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL3</name>
                            <description>PCL3</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R20</name>
                            <description>R20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
