J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>OMSR</name>
                    <description>OMSR</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PS0</name>
                            <description>PS0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS1</name>
                            <description>PS1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS2</name>
                            <description>PS2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS3</name>
                            <description>PS3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS4</name>
                            <description>PS4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS5</name>
                            <description>PS5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS6</name>
                            <description>PS6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS7</name>
                            <description>PS7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS8</name>
                            <description>PS8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS9</name>
                            <description>PS9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS10</name>
                            <description>PS10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS11</name>
                            <description>PS11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS12</name>
                            <description>PS12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS13</name>
                            <description>PS13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS14</name>
                            <description>PS14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS15</name>
                            <description>PS15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>R16</name>
                            <description>R16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
