J3FF-J4N/tc375-freertos/tc37x-pac/tc37x-stm-port.svd.xml
                <register>
                    <name>OMCR</name>
                    <description>OMCR</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCL0</name>
                            <description>PCL0</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL1</name>
                            <description>PCL1</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL2</name>
                            <description>PCL2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL3</name>
                            <description>PCL3</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL4</name>
                            <description>PCL4</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL5</name>
                            <description>PCL5</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL6</name>
                            <description>PCL6</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL7</name>
                            <description>PCL7</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL8</name>
                            <description>PCL8</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL9</name>
                            <description>PCL9</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL10</name>
                            <description>PCL10</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL11</name>
                            <description>PCL11</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL12</name>
                            <description>PCL12</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL13</name>
                            <description>PCL13</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL14</name>
                            <description>PCL14</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PCL15</name>
                            <description>PCL15</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Const_0</name>
                                    <description>Const_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Const_1</name>
                                    <description>Const_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACCEN1</name>
                    <description>ACCEN1</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>R0</name>
                            <description>R0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
